app/controllers/admin_user_controller.rb

    def disable_otp
        current_admin_user.otp_required_for_login = false
        current_admin_user.save!
---
UPDATE "admin_users" SET "updated_at" = ?, "otp_required_for_login" = ? WHERE "admin_users"."id" = ?  [["updated_at", "2022-10-07 08:29:04.599467"], ["otp_required_for_login", "[FILTERED]"], ["id", 1]]

      def enable_otp
        current_admin_user.otp_secret = AdminUser.generate_otp_secret
        current_admin_user.otp_required_for_login = true
        current_admin_user.save!
---
UPDATE "admin_users" SET "updated_at" = ?, "otp_secret" = ?, "otp_required_for_login" = ? WHERE "admin_users"."id" = ?  [["updated_at", "2022-10-07 09:59:19.257538"], ["otp_secret", "[FILTERED]"], ["otp_required_for_login", "[FILTERED]"], ["id", 2]]