app/controllers/articles_controller.rb

    def create
        @article = Article.new(article_params)
        if @article.save
---
INSERT INTO "articles" ("title", "created_at", "updated_at", "description") VALUES (?, ?, ?, ?)  [["title", "first new title"], ["created_at", "2022-09-25 13:16:08.508700"], ["updated_at", "2022-09-25 13:16:08.508700"], ["description", "new description"]]